{
  "id": "003",
  "text": "Блочная архитектура редактора: каждый элемент контента (абзац, заголовок, таблица, изображение, формула, диаграмма, код) является независимым блоком с уникальным ID, типом, содержимым, метаданными, поддержкой вложенности и CRUD операций через API",
  "categories": [
    "ai-criteria",
    "architecture",
    "editor",
    "quality"
  ],
  "tags": [
    "API",
    "CRUD",
    "UUID",
    "блоки",
    "вложенность",
    "независимость",
    "типы блоков"
  ],
  "categories_info": [
    {
      "key": "architecture",
      "title": "Общие архитектурные принципы для движка",
      "description": "Фундаментальные правила построения всей системы"
    },
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    }
  ],
  "contexts": {
    "architecture": {
      "subcategories": [],
      "descriptions": {
        "null": "Фундаментальный архитектурный принцип блочности: система построена на концепции независимых блоков как базовых строительных элементов, каждый блок является самодостаточной единицей с собственным жизненным циклом, блоки не зависят друг от друга на уровне реализации (слабая связанность), изменение одного блока не влияет на другие блоки, блоки могут быть легко добавлены, удалены или заменены без влияния на систему в целом, архитектура поддерживает расширение новыми типами блоков через plugin system, единый интерфейс для работы со всеми типами блоков (полиморфизм), блоки сериализуются в единый формат (JSON) для хранения и передачи"
      }
    },
    "editor": {
      "subcategories": [
        "Блоки контента"
      ],
      "descriptions": {
        "Блоки контента": "Полностью блочная архитектура редактора где каждый элемент контента является независимым блоком: 1) Типы блоков - Текстовые: paragraph (обычный текст), heading (H1-H6 заголовки), quote (цитата), callout (выделенный блок с иконкой и цветом). Списки: bullet-list (маркированный), numbered-list (нумерованный), todo-list (чек-лист с checkbox), toggle-list (сворачиваемый список). Медиа: image (изображение с подписью и alt-текстом), video (видео с плеером), audio (аудио с плеером), file (прикрепленный файл). Структурные: table (таблица с ячейками), divider (горизонтальная линия-разделитель), columns (многоколоночный layout), page (вложенная страница). Продвинутые: code (блок кода с подсветкой синтаксиса), math (формула LaTeX/KaTeX), mermaid (диаграмма Mermaid), excalidraw (рисование), canvas (HTML5 canvas), database (таблица-база данных), kanban (канбан доска), timeline (временная шкала), calendar (календарь), embed (встраивание внешнего контента по URL). 2) Структура блока - id: уникальный идентификатор (UUID v4 или custom BLOCK_ID), type: тип блока из предопределенного списка, content: содержимое блока (текст, данные, конфигурация), metadata: {created_at, updated_at, author, version}, properties: специфичные для типа свойства (например для image: url, caption, width, height), styles: пользовательские стили и форматирование, parent_id: ID родительского блока для вложенности, children: массив ID дочерних блоков, order: позиция блока в документе (для сортировки). 3) Независимость блоков - каждый блок существует автономно и может быть создан, отредактирован, перемещен, скопирован, удален независимо от других блоков, блок сохраняет свое состояние и данные внутри себя, блок не имеет прямых зависимостей от других блоков (только через ссылки по ID), изменение содержимого блока не влияет на другие блоки, блок может быть экспортирован/импортирован отдельно от документа. 4) Вложенность блоков - блоки могут содержать другие блоки для создания иерархических структур (например список с вложенными подпунктами, toggle с вложенным контентом, columns с блоками в каждой колонке), поддержка неограниченной глубины вложенности, parent-child связи через parent_id и children массив, автоматическое управление порядком дочерних блоков, каскадное удаление дочерних блоков при удалении родителя (с опцией сохранения). 5) API для работы с блоками - CRUD операции: createBlock(type, content, parent_id), getBlock(id), updateBlock(id, changes), deleteBlock(id), поиск блоков: findBlocks(query), findBlocksByType(type), findBlocksByParent(parent_id), операции с деревом: moveBlock(id, new_parent_id, new_order), copyBlock(id, target_parent_id), массовые операции: createBlocks(blocks_array), updateBlocks(updates_array), deleteBlocks(ids_array), сериализация: serializeBlock(id), deserializeBlock(json), экспорт/импорт: exportBlock(id, format), importBlock(data, format)"
      }
    },
    "quality": {
      "subcategories": [
        "Архитектурная целостность"
      ],
      "descriptions": {
        "Архитектурная целостность": "Требования к качеству блочной архитектуры: валидация структуры блоков при создании и обновлении (проверка обязательных полей id, type, content), проверка типов данных в полях блока согласно схеме, валидация вложенности (предотвращение циклических зависимостей parent-child), проверка уникальности ID блоков в пределах документа, автоматическое исправление некорректных структур при импорте, логирование всех операций с блоками для аудита и отладки, метрики производительности операций с блоками (время создания, обновления, поиска), тестовое покрытие >80% для всех операций с блоками, документация структуры каждого типа блока с примерами JSON, схемы валидации (JSON Schema) для каждого типа блока"
      }
    },
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Требования к ИИ для работы с блочной архитектурой: понимание структуры блоков и их типов для корректной генерации контента, автоматический выбор подходящего типа блока на основе контекста (текст → paragraph, код → code block, данные → table), генерация блоков с корректной структурой (все обязательные поля заполнены), предложение оптимальной структуры документа через комбинацию разных типов блоков, автоматическая организация контента в иерархию блоков (заголовки → подзаголовки → параграфы → списки), рефакторинг существующих блоков (разбиение большого блока на несколько, объединение связанных блоков), предложение использования продвинутых типов блоков (таблица вместо списка для табличных данных, timeline для хронологии событий), валидация сгенерированных блоков перед вставкой в документ"
      }
    }
  }
}