{
  "id": "010",
  "text": "Перемещение блоков: возможность перемещать блоки внутри документа и между документами с сохранением всех свойств и связей, drag-and-drop перемещение блоков мышью с визуальной индикацией места вставки, горячие клавиши для перемещения блоков вверх/вниз (Alt+Up/Down или Cmd+Shift+Up/Down), трансформация типа блока (преобразование текста в заголовок, список в чек-лист, параграфа в цитату и обратно) через меню или slash-команды, копирование и вставка блоков с сохранением форматирования, перемещение блоков между разными страницами/документами через drag-and-drop или cut/paste, множественное выделение и перемещение группы блоков одновременно, отмена/повтор операций перемещения (undo/redo), сохранение истории перемещений для аудита, автоматическое обновление ссылок и связей при перемещении блоков, предпросмотр результата перемещения перед применением",
  "categories": [
    "ai-criteria",
    "editor",
    "quality"
  ],
  "tags": [
    "блоки",
    "UX",
    "drag-and-drop",
    "трансформация",
    "горячие клавиши",
    "копирование",
    "перемещение"
  ],
  "categories_info": [
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    }
  ],
  "contexts": {
    "editor": {
      "subcategories": [
        "Блоки контента",
        "Навигация и связи"
      ],
      "descriptions": {
        "Блоки контента": "Функционал перемещения и трансформации блоков: 1) Drag-and-drop перемещение - захват блока мышью за специальный handle (иконка ⋮⋮ слева от блока), визуальная индикация возможных мест вставки (синяя линия между блоками), плавная анимация перемещения блока, автоматический скролл при перетаскивании к краям экрана, drop zones для вставки блока в нужное место, отмена перемещения при нажатии Esc во время drag. 2) Горячие клавиши - Alt+Up/Cmd+Shift+Up для перемещения блока вверх, Alt+Down/Cmd+Shift+Down для перемещения блока вниз, Ctrl+X/Cmd+X для вырезания блока, Ctrl+C/Cmd+C для копирования блока, Ctrl+V/Cmd+V для вставки блока, Ctrl+D/Cmd+D для дублирования блока, Ctrl+Z/Cmd+Z для отмены перемещения. 3) Трансформация типа блока - меню трансформации по клику на иконку типа блока или через slash-команды (/heading, /list, /quote), преобразование текста в заголовок (H1-H6) с сохранением содержимого, преобразование параграфа в список (маркированный/нумерованный), преобразование списка в чек-лист с checkbox, преобразование текста в цитату или callout, преобразование текста в блок кода с выбором языка, обратная трансформация (заголовок → текст, список → параграф), сохранение форматирования при трансформации где возможно. 4) Перемещение между документами - drag-and-drop блока из одного документа в другой открытый в соседней вкладке/окне, cut/paste для перемещения блоков между документами, автоматическое обновление внутренних ссылок при перемещении, сохранение всех свойств блока (ID, метаданные, форматирование), предупреждение о потере связей если блок имеет backlinks, опция создания redirect/alias при перемещении важных блоков. 5) Множественное выделение - Shift+Click для выделения диапазона блоков, Ctrl+Click/Cmd+Click для выборочного выделения блоков, выделение всех блоков Ctrl+A/Cmd+A, визуальная индикация выделенных блоков (фон, рамка), групповое перемещение всех выделенных блоков, групповое удаление, копирование, трансформация. 6) История и отмена - полная поддержка undo/redo для всех операций перемещения, сохранение истории перемещений в metadata блока для аудита, возможность просмотра истории перемещений блока, восстановление блока из истории при случайном удалении",
        "Навигация и связи": "Управление связями при перемещении блоков: автоматическое обновление всех ссылок на блок при его перемещении в другой документ, обновление backlinks в связанных блоках, сохранение block references и embeds при перемещении, предупреждение пользователя о наличии связей перед перемещением, опция создания redirect для старого местоположения блока, обновление граф зависимостей после перемещения, валидация целостности связей после перемещения, автоматическое исправление битых ссылок"
      }
    },
    "quality": {
      "subcategories": [
        "UI компоненты"
      ],
      "descriptions": {
        "UI компоненты": "Требования к UX перемещения блоков: 1) Визуальная обратная связь - четкая индикация что блок можно перемещать (handle, курсор pointer), визуальный feedback при hover над handle, плавная анимация перемещения (300ms transition), индикация места вставки (синяя линия 2px), ghost image блока при drag-and-drop, изменение курсора при drag (grabbing), визуальное подтверждение успешного перемещения. 2) Доступность - поддержка перемещения только клавиатурой без мыши, screen reader announcements при перемещении блоков, focus management при перемещении, ARIA атрибуты для drag-and-drop, альтернативные способы перемещения для пользователей с ограниченными возможностями. 3) Производительность - оптимизация рендеринга при перемещении больших блоков, виртуализация списка блоков для быстрого скролла, debounce для автоскролла при drag, отложенное обновление связей после перемещения, batch updates для множественного перемещения. 4) Мобильная адаптация - long press для активации drag на touch устройствах, touch-friendly drag handles (минимум 44x44px), haptic feedback при перемещении на мобильных, адаптивные жесты для перемещения, упрощенное меню трансформации для мобильных"
      }
    },
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Требования к ИИ для работы с перемещением блоков: автоматическое предложение оптимального места для нового блока на основе контекста, интеллектуальная группировка связанных блоков при перемещении, предложение трансформации типа блока на основе содержимого (если текст начинается с цифры - предложить нумерованный список), автоматическое создание структуры документа при вставке множества блоков, предупреждение о потенциальных проблемах при перемещении (потеря связей, нарушение логики документа), предложение альтернативных мест для вставки блока, автоматическое обновление оглавления при перемещении заголовков, генерация описания изменений при перемещении для истории"
      }
    }
  }
}
