{
  "id": "050",
  "text": "Тестирование изменений: обязательная проверка всех изменений кода перед коммитом, запуск unit тестов после каждого изменения для проверки изолированных компонентов, интеграционные тесты для связанных компонентов и модулей, E2E тесты для критических пользовательских путей, проверка консоли браузера на ошибки и предупреждения после каждого изменения, валидация работоспособности функционала вручную, автоматические тесты в CI/CD пайплайне, проверка производительности при значительных изменениях, регрессионное тестирование для предотвращения поломки существующего функционала, использование pre-commit hooks для автоматической проверки перед коммитом, test coverage должен быть >80%, документирование результатов тестирования",
  "categories": [
    "ai-criteria",
    "processes",
    "quality",
    "tools"
  ],
  "tags": [
    "тесты",
    "валидация",
    "CI/CD",
    "автоматизация",
    "качество",
    "регрессия",
    "coverage"
  ],
  "categories_info": [
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "processes",
      "title": "Процессы разработки",
      "description": "Методологии и практики работы команды"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    },
    {
      "key": "tools",
      "title": "Инструменты",
      "description": "Практические инструменты для упрощения парной разработки с ИИ-ассистентом"
    }
  ],
  "contexts": {
    "quality": {
      "subcategories": [
        "Тестирование"
      ],
      "descriptions": {
        "Тестирование": "Требования к тестированию изменений: 1) Типы проверок - unit тесты для изолированного тестирования функций и компонентов (Jest, Mocha, Vitest), интеграционные тесты для проверки взаимодействия модулей, E2E тесты для критических пользовательских сценариев (Cypress, Playwright, Puppeteer), ручное тестирование измененного функционала, smoke тесты для быстрой проверки основной функциональности, регрессионные тесты для предотвращения поломки существующего функционала. 2) Метрики качества - test coverage >80% для нового кода, все unit тесты должны проходить перед коммитом, интеграционные тесты должны проходить перед merge в main, E2E тесты должны проходить перед релизом, время выполнения тестов <5 минут для быстрой обратной связи, отсутствие ошибок и предупреждений в консоли браузера. 3) Автоматизация - pre-commit hooks для запуска линтеров и форматтеров, pre-push hooks для запуска unit тестов, CI/CD пайплайн для автоматического запуска всех тестов при push, автоматическое создание отчетов о покрытии тестами, автоматическое блокирование merge при падении тестов, scheduled тесты для проверки стабильности. 4) Инструменты - Jest/Mocha/Vitest для unit тестов, Cypress/Playwright/Puppeteer для E2E тестов, Istanbul/NYC для измерения coverage, Husky для git hooks, GitHub Actions/GitLab CI для CI/CD, SonarQube для анализа качества кода"
      }
    },
    "processes": {
      "subcategories": [
        "Troubleshooting и отладка"
      ],
      "descriptions": {
        "Troubleshooting и отладка": "Процесс проверки изменений: 1) Перед коммитом - запуск линтеров и форматтеров для проверки стиля кода, запуск unit тестов для измененных модулей, проверка консоли браузера на ошибки и предупреждения, ручная проверка работоспособности измененного функционала, проверка связанных компонентов на поломку, валидация что все файлы сохранены и скомпилированы. 2) После коммита - автоматический запуск всех тестов в CI/CD, проверка отчетов о покрытии тестами, анализ результатов статического анализа кода, проверка что build прошел успешно, валидация что нет конфликтов с другими изменениями. 3) Перед merge - запуск полного набора интеграционных тестов, запуск E2E тестов для критических путей, код-ревью с фокусом на тестируемость, проверка что все комментарии в PR адресованы, валидация что документация обновлена. 4) Документирование - запись результатов тестирования в PR, документирование найденных проблем и способов исправления, обновление тестовых сценариев при изменении функционала, создание чек-листа проверки для типовых изменений"
      }
    },
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Требования к ИИ при генерации кода: автоматическое добавление unit тестов для каждой новой функции, генерация тестовых сценариев для нового функционала, предложение edge cases для тестирования, валидация что сгенерированный код не ломает существующие тесты, предупреждение о потенциальных проблемах с тестируемостью, генерация mock данных для тестов, предложение использования test-driven development (TDD) подхода, автоматическая проверка coverage после генерации кода"
      }
    },
    "tools": {
      "subcategories": [],
      "descriptions": {
        "null": "Инструменты для тестирования изменений: 1) Unit тестирование - Jest для JavaScript/TypeScript с поддержкой mocking и snapshot тестов, Mocha + Chai для гибкой настройки тестов, Vitest для быстрого тестирования Vite проектов, AVA для параллельного выполнения тестов. 2) E2E тестирование - Cypress для удобного написания и отладки E2E тестов, Playwright для кросс-браузерного тестирования, Puppeteer для автоматизации Chrome/Chromium, TestCafe для тестирования без WebDriver. 3) Coverage - Istanbul/NYC для измерения покрытия кода тестами, Codecov/Coveralls для визуализации coverage в CI/CD, встроенные инструменты coverage в Jest/Vitest. 4) Git hooks - Husky для настройки pre-commit и pre-push hooks, lint-staged для запуска линтеров только на измененных файлах, commitlint для валидации формата commit сообщений. 5) CI/CD - GitHub Actions для автоматизации тестирования в GitHub, GitLab CI для GitLab проектов, CircleCI/Travis CI для универсальных решений, Jenkins для self-hosted CI/CD. 6) Статический анализ - ESLint для проверки JavaScript/TypeScript кода, SonarQube для комплексного анализа качества, TypeScript compiler для проверки типов"
      }
    }
  }
}