{
  "id": "051",
  "text": "Работоспособность на каждом шаге: инкрементальная разработка с проверкой работоспособности после каждого изменения, каждый коммит должен содержать работающий код без ошибок компиляции и runtime, система должна запускаться и функционировать после каждого шага разработки, избегание больших изменений без промежуточных проверок и коммитов, возможность отката к предыдущему работающему состоянию в любой момент, continuous integration для автоматической проверки работоспособности при каждом push, чек-лист проверки перед коммитом (код компилируется, тесты проходят, консоль чиста, функционал работает), atomic commits где каждый коммит представляет законченное логическое изменение, принцип никогда не коммитить неработающий код, разбиение больших задач на маленькие инкрементальные шаги с проверкой после каждого",
  "categories": [
    "ai-criteria",
    "processes",
    "quality",
    "tools"
  ],
  "tags": [
    "инкрементальность",
    "atomic commits",
    "CI/CD",
    "работоспособность",
    "откат",
    "чек-лист"
  ],
  "categories_info": [
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "processes",
      "title": "Процессы разработки",
      "description": "Методологии и практики работы команды"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    },
    {
      "key": "tools",
      "title": "Инструменты",
      "description": "Практические инструменты для упрощения парной разработки с ИИ-ассистентом"
    }
  ],
  "contexts": {
    "quality": {
      "subcategories": [
        "Best Practices & Code Review"
      ],
      "descriptions": {
        "Best Practices & Code Review": "Обеспечение работоспособности на каждом шаге: 1) Чек-лист перед коммитом - код компилируется без ошибок (npm run build успешен), все unit тесты проходят (npm test успешен), консоль браузера чиста от ошибок и предупреждений, измененный функционал работает корректно при ручной проверке, связанные компоненты не сломаны, нет TODO или FIXME в коммитируемом коде без объяснения, документация обновлена при необходимости. 2) Принципы atomic commits - каждый коммит представляет одно логическое изменение, коммит можно описать одним предложением, коммит можно откатить без побочных эффектов, коммит содержит все необходимые изменения (код + тесты + документация), коммит не содержит несвязанных изменений. 3) Принцип никогда не коммитить неработающий код - система должна запускаться после каждого коммита, все существующие тесты должны проходить, новый функционал должен быть хотя бы частично работоспособным, если изменение большое - использовать feature flags для скрытия незавершенного функционала, WIP коммиты допустимы только в feature ветках но не в main/develop. 4) Откат к работающему состоянию - использование git revert для отката проблемных коммитов, возможность быстрого отката через CI/CD, сохранение работающих версий через git tags, документирование известных работающих состояний"
      }
    },
    "processes": {
      "subcategories": [
        "Работа с задачами"
      ],
      "descriptions": {
        "Работа с задачами": "Процесс инкрементальной разработки: 1) Разбиение задач - декомпозиция большой задачи на маленькие подзадачи по 1-4 часа работы, каждая подзадача должна приводить к работающему состоянию, определение порядка выполнения подзадач с учетом зависимостей, планирование промежуточных проверок работоспособности. 2) Цикл разработки - выбор одной маленькой подзадачи, реализация минимального работающего решения, проверка работоспособности (запуск тесты консоль), коммит с описательным сообщением, переход к следующей подзадаче. 3) Проверка после каждого шага - запуск приложения для проверки что оно стартует, проверка измененного функционала вручную, запуск связанных тестов, проверка консоли на ошибки, валидация что ничего не сломалось. 4) Коммит после каждого успешного шага - коммит сразу после успешной проверки, описательное commit сообщение с контекстом изменения, push в удаленный репозиторий для backup, автоматическая проверка в CI/CD. 5) Возможность отката - каждый коммит точка возврата, использование git log для просмотра истории, git revert для отката проблемных изменений, git bisect для поиска коммита вызвавшего проблему"
      }
    },
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Требования к ИИ для инкрементальной разработки: декомпозиция больших задач на маленькие инкрементальные шаги, генерация кода который работает после каждого шага, предложение промежуточных проверок работоспособности, валидация что каждое изменение не ломает существующий функционал, предупреждение о потенциальных проблемах с работоспособностью, предложение использования feature flags для больших изменений, генерация atomic commits с описательными сообщениями, автоматическая проверка что код компилируется и тесты проходят"
      }
    },
    "tools": {
      "subcategories": [],
      "descriptions": {
        "null": "Инструменты для обеспечения работоспособности: 1) Git hooks - Husky для настройки pre-commit hooks проверяющих работоспособность, pre-push hooks для запуска тестов перед push, commit-msg hooks для валидации формата сообщений. 2) CI/CD - автоматическая проверка работоспособности при каждом push, быстрая обратная связь о проблемах (< 5 минут), автоматическое блокирование merge при падении проверок, уведомления о проблемах в Slack/email. 3) Мониторинг - отслеживание метрик работоспособности (build success rate test pass rate), алерты при падении метрик, dashboard с текущим статусом всех веток. 4) Откат - git revert для безопасного отката коммитов, git bisect для поиска проблемного коммита, автоматический откат через CI/CD при критических проблемах, сохранение работающих версий через git tags и GitHub Releases"
      }
    }
  }
}
