{
  "id": "080",
  "text": "Автоматическое версионирование и сохранение истории изменений с ведением CHANGELOG: использование Git с автоматическими коммитами через GitDoc для VS Code, сохранение рабочих и полурабочих файлов с полной историей изменений, автоматическое создание снимков состояния проекта при каждом сохранении, возможность отката к любой предыдущей версии, интеграция с GitHub/GitLab для удаленного хранения истории, создание релизов и тегов для стабильных версий (GitHub Releases), автоматическое документирование изменений в CHANGELOG.md по стандарту Keep a Changelog с категориями (Added, Changed, Deprecated, Removed, Fixed, Security), вставка новых записей в начало файла (reverse chronological order), связь с semantic versioning, автоматическая генерация changelog из Git коммитов, восстановление удаленных файлов из истории Git",
  "categories": [
    "processes",
    "tools"
  ],
  "tags": [
    "версионирование",
    "git",
    "gitdoc",
    "история изменений",
    "автоматизация",
    "откат",
    "CHANGELOG",
    "Keep a Changelog",
    "semantic versioning",
    "reverse chronological"
  ],
  "categories_info": [
    {
      "key": "processes",
      "title": "Процессы разработки",
      "description": "Методологии и практики работы команды"
    },
    {
      "key": "tools",
      "title": "Инструменты",
      "description": "Практические инструменты для упрощения парной разработки с ИИ-ассистентом"
    }
  ],
  "contexts": {
    "processes": {
      "subcategories": [
        "Версионирование и история изменений"
      ],
      "descriptions": {
        "Версионирование и история изменений": "Процесс автоматического версионирования кода с сохранением полной истории изменений и ведением CHANGELOG.md: 1) Формат CHANGELOG - следование стандарту Keep a Changelog (https://keepachangelog.com), структура файла с секциями [Unreleased] для незарелизенных изменений и [X.Y.Z] для каждой версии с датой релиза, reverse chronological order (новые записи вставляются в начало файла после заголовка), каждая версия содержит категории изменений. 2) Категории изменений - Added для новых функций и возможностей, Changed для изменений в существующем функционале, Deprecated для функций которые будут удалены в будущих версиях, Removed для удаленных функций, Fixed для исправлений багов, Security для исправлений уязвимостей безопасности. 3) Формат записи - краткое описание изменения в одну строку, ссылка на issue или PR если применимо, группировка связанных изменений, использование активного залога (Added feature X, Fixed bug Y). 4) Автоматическая генерация - генерация changelog из Git коммитов через conventional commits (feat:, fix:, docs:, etc), автоматическое определение категории изменения по префиксу коммита, автоматическое обновление CHANGELOG при создании релиза, интеграция с semantic versioning (major.minor.patch). 5) Связь с версионированием - каждая запись в CHANGELOG связана с версией по semantic versioning, breaking changes отмечаются явно и увеличивают major версию, новые фичи увеличивают minor версию, исправления багов увеличивают patch версию, автоматическое создание GitHub Release с содержимым из CHANGELOG для версии"
      }
    },
    "tools": {
      "subcategories": [],
      "descriptions": {
        "null": "Инструменты для версионирования и ведения CHANGELOG: 1) GitDoc для VS Code - расширение для автоматического версионирования с мгновенными коммитами при каждом сохранении файла, настройка автокоммитов для рабочих файлов. 2) Git для полной истории изменений - просмотр diff между версиями, cherry-pick для выборочного применения изменений, revert для отката изменений, blame для отслеживания авторства. 3) Conventional Commits - стандарт оформления коммитов (feat:, fix:, docs:, style:, refactor:, test:, chore:), автоматическое определение типа изменения, генерация changelog из коммитов. 4) Инструменты генерации CHANGELOG - standard-version для автоматического версионирования и генерации changelog, semantic-release для полной автоматизации релизов, conventional-changelog для генерации из коммитов, auto-changelog для простой генерации. 5) GitHub/GitLab - удаленное хранение и совместная работа, GitHub Releases для создания стабильных версий с changelog, автоматическое создание release notes из CHANGELOG, интеграция с CI/CD. 6) Шаблон CHANGELOG.md - заголовок с ссылкой на Keep a Changelog и Semantic Versioning, секция [Unreleased] для текущих изменений, секции версий в reverse chronological order, каждая версия с датой в формате YYYY-MM-DD, категории изменений (Added, Changed, Deprecated, Removed, Fixed, Security), ссылки на сравнение версий в Git"
      }
    }
  }
}