{
  "id": "165",
  "text": "@-упоминания и slash-команды для быстрой вставки блоков: ввод @ для поиска и вставки ссылок на блоки/страницы с автодополнением, создание двунаправленных связей (backlinks), предпросмотр при hover, ввод / для меню команд создания блоков разных типов (/heading, /table, /code, /image, /kanban), категоризация команд, поиск по ключевым словам, unlinked mentions, интеграция с графом зависимостей",
  "categories": [
    "editor"
  ],
  "tags": [
    "UI",
    "@-упоминания",
    "backlinks",
    "slash-команды",
    "автодополнение",
    "блоки",
    "навигация",
    "связи"
  ],
  "categories_info": [
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    }
  ],
  "contexts": {
    "editor": {
      "subcategories": [
        "Блоки контента",
        "Навигация и связи"
      ],
      "descriptions": {
        "Блоки контента": "Система slash-команд для быстрого создания блоков: 1) Вызов меню - ввод символа / в начале пустой строки или в любом месте текста для вызова командного меню, автоматическое открытие выпадающего списка доступных команд, фильтрация команд при продолжении ввода после / (например /head покажет команды heading), навигация по списку стрелками вверх/вниз, выбор команды Enter или кликом мыши, отмена меню Esc или удаление символа /. 2) Категории команд - Текст: /text (параграф), /heading или /h1-h6 (заголовки), /quote (цитата), /callout (выделенный блок), /toggle (сворачиваемая секция). Списки: /bullet (маркированный список), /numbered (нумерованный список), /todo или /checkbox (чек-лист), /toggle-list (сворачиваемый список). Медиа: /image (изображение), /video (видео), /audio (аудио), /file (файл), /embed (встраивание URL). Структура: /divider или /--- (разделитель), /table (таблица), /columns (колонки), /page (вложенная страница). Продвинутые блоки: /code (блок кода), /math или /latex (формула), /mermaid (диаграмма Mermaid), /excalidraw (рисование), /canvas (canvas), /kanban (канбан доска), /timeline (временная шкала), /calendar (календарь), /database (база данных). 3) Автодополнение и поиск - автодополнение команд при вводе (fuzzy search), подсветка совпадающих символов в названиях команд, отображение описания команды при hover или выделении, отображение горячих клавиш для команды если есть, поиск команд по синонимам (например 'картинка' найдет /image), история последних использованных команд для быстрого доступа, избранные команды пользователя в начале списка. 4) Параметры команд - некоторые команды открывают дополнительное меню параметров (/heading предлагает выбрать уровень H1-H6, /code предлагает выбрать язык программирования, /table предлагает указать количество строк и столбцов, /callout предлагает выбрать тип: info, warning, error, success), возможность указать параметры сразу в команде (/h2, /code:javascript, /table:3x4), предпросмотр результата команды перед применением. 5) Кастомизация - возможность создавать пользовательские slash-команды для часто используемых шаблонов блоков, назначение алиасов для команд (например /img для /image), отключение ненужных команд из меню, изменение порядка команд в меню, экспорт/импорт набора команд",
        "Навигация и связи": "Система @-упоминаний для создания связей между блоками и страницами: 1) Вызов меню упоминаний - ввод символа @ в любом месте текста для вызова меню поиска, автоматическое открытие выпадающего списка блоков и страниц, фильтрация результатов при продолжении ввода после @ (fuzzy search по названиям и содержимому), навигация по списку стрелками, выбор элемента Enter или кликом, отмена меню Esc или удаление @. 2) Типы упоминаний - @page - ссылка на страницу/документ (создает обычную гиперссылку), @block - ссылка на конкретный блок по его ID (создает block reference), @embed - встраивание живой копии блока (block embed/transclusion с автообновлением при изменении оригинала), @user - упоминание пользователя в коллаборативном режиме (отправляет уведомление), @date - вставка даты с календарем для выбора. 3) Автодополнение и поиск - поиск по названиям страниц и заголовкам блоков, поиск по содержимому блоков (full-text search), отображение пути к блоку (breadcrumbs) для уточнения контекста, отображение превью блока/страницы при hover или выделении в списке, подсветка совпадающих символов в результатах поиска, сортировка результатов по релевантности и частоте использования, история последних упомянутых блоков/страниц, фильтры по типу (только страницы, только блоки, только пользователи). 4) Двунаправленные связи (backlinks) - автоматическое создание обратной ссылки при упоминании блока/страницы, отображение секции Backlinks внизу страницы со списком всех страниц ссылающихся на текущую, отображение контекста backlink (несколько строк текста вокруг ссылки), кликабельные backlinks для быстрого перехода к источнику ссылки, счетчик количества backlinks, группировка backlinks по источнику (странице). 5) Unlinked mentions - автоматическое обнаружение упоминаний названия страницы в тексте без явной ссылки, отображение секции Unlinked Mentions со списком потенциальных связей, возможность преобразовать unlinked mention в полноценную ссылку одним кликом, фильтрация false positives (исключение нерелевантных совпадений), настройка чувствительности поиска unlinked mentions. 6) Предпросмотр и навигация - hover preview при наведении на ссылку/упоминание (всплывающее окно с содержимым блока/страницы), возможность редактировать блок прямо в preview без перехода, Ctrl+Click или Cmd+Click для открытия ссылки в новой вкладке, Alt+Click для открытия в боковой панели, breadcrumb trail для отслеживания пути навигации по ссылкам, кнопка Back для возврата к предыдущему блоку. 7) Интеграция с графом зависимостей - автоматическое добавление связей в граф при создании @-упоминаний, визуализация связей между блоками и страницами в graph view, подсветка связанных узлов при выборе блока в графе, фильтрация графа по типу связей (page links, block references, embeds), анализ силы связей (количество упоминаний между блоками), обнаружение кластеров связанных блоков, экспорт графа связей"
      }
    }
  }
}
