{
  "id": "167",
  "text": "Database блоки: базы данных как блоки контента с множественными представлениями (Table, Board, Calendar, Gallery, Timeline, List, Gantt), настраиваемыми свойствами (текст, число, дата, select, multi-select, person, files, checkbox, URL, email, phone, formula, relation, rollup), формулами для вычисляемых полей, rollup для агрегации данных из связанных записей, relation для создания связей между записями разных БД (one-to-one, one-to-many, many-to-many), обратными отношениями (backlinks), linked databases для создания нескольких представлений одной БД с независимыми фильтрами, синхронизацией в реальном времени, фильтрацией, сортировкой, группировкой, поиском, экспортом/импортом",
  "categories": [
    "editor"
  ],
  "tags": [
    "Board",
    "Calendar",
    "Gantt",
    "Gallery",
    "List",
    "Table",
    "Timeline",
    "UI",
    "блоки",
    "данные",
    "календарь",
    "представления",
    "связи",
    "таблицы",
    "формулы"
  ],
  "categories_info": [
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    }
  ],
  "contexts": {
    "editor": {
      "subcategories": [
        "Блоки контента"
      ],
      "descriptions": {
        "Блоки контента": "Реализация Database блоков как полноценных баз данных внутри документа: 1) Типы свойств - Text (однострочный и многострочный текст), Number (целые числа, десятичные, проценты, валюты), Select (выбор одного значения из списка с цветовым кодированием), Multi-select (выбор нескольких значений), Date (дата, дата+время, диапазон дат), Person (назначение пользователей), Files & Media (прикрепление файлов и изображений), Checkbox (булево значение true/false), URL (ссылки с автоматической валидацией), Email (email адреса с валидацией), Phone (телефонные номера), Formula (вычисляемые поля с формулами), Relation (связи с другими БД), Rollup (агрегация данных из связанных записей), Created time/by (автоматические метаданные), Last edited time/by (автоматическое отслеживание изменений). 2) Представления БД - Table view: классическая таблица с колонками-свойствами и строками-записями, сортировка по любым колонкам (ascending/descending), фильтрация по условиям (equals, not equals, contains, does not contain, is empty, is not empty, greater than, less than), группировка записей по свойствам с подсчетом в группах, закрепление колонок (pin columns), изменение ширины колонок, скрытие/показ колонок, изменение порядка колонок drag-and-drop. Board view (Kanban): визуализация записей как карточек на доске, группировка по Select или Multi-select свойству (каждое значение = колонка), drag-and-drop карточек между колонками для изменения значения группирующего свойства, настройка отображаемых свойств на карточках, цветовое кодирование карточек, подсчет карточек в колонках, лимиты WIP для колонок. Calendar view: отображение записей на календаре по Date свойству, месячный, недельный, дневной режимы просмотра, drag-and-drop для изменения дат, цветовое кодирование событий по свойствам, отображение диапазонов дат как протяженных событий. Gallery view: карточки записей с превью изображений из Files свойства, настройка размера карточек (small, medium, large), настройка отображаемых свойств под превью, фильтрация и сортировка галереи. Timeline view: временная шкала для планирования с записями как событиями, горизонтальная ось времени с масштабированием (дни, недели, месяцы, кварталы, годы), отображение диапазонов дат как полос на timeline, группировка по свойствам, зависимости между задачами. List view: компактный список записей с минимальным отображением свойств, быстрая навигация и поиск, группировка и фильтрация. Gantt chart: диаграмма Ганта для управления проектами, отображение задач с датами начала и окончания, зависимости между задачами (finish-to-start, start-to-start, finish-to-finish), критический путь проекта, процент выполнения задач, ресурсы и назначения. 3) Формулы - Математические операции: +, -, *, /, %, pow, sqrt, abs, round, floor, ceil, min, max, sign. Текстовые функции: concat, join, slice, length, format, contains, replace, replaceAll, test (regex), upper, lower, trim. Логические операции: if(condition, then, else), and, or, not, empty, equal. Функции для дат: now, timestamp, fromTimestamp, dateAdd, dateSubtract, dateBetween, formatDate, year, month, day, hour, minute. Функции для свойств: prop(\"property_name\") для доступа к значениям свойств записи. Агрегация: используется через Rollup свойства. Примеры формул: if(prop(\"Status\") == \"Done\", \"✅\", \"⏳\"), concat(prop(\"First Name\"), \" \", prop(\"Last Name\")), dateBetween(now(), prop(\"Deadline\"), \"days\"). 4) Rollup свойства - Агрегация данных из связанных записей через Relation свойство, функции агрегации: count (количество связанных записей), count values (количество непустых значений), count unique values (количество уникальных значений), count empty (количество пустых), count not empty (количество непустых), percent empty/not empty (процент пустых/непустых), sum (сумма числовых значений), average (среднее), median (медиана), min (минимум), max (максимум), range (разница между max и min), earliest date (самая ранняя дата), latest date (самая поздняя дата), date range (диапазон дат), show original (отображение всех значений как список), show unique (отображение уникальных значений). Примеры: Rollup для подсчета количества задач в проекте, суммирования бюджетов связанных записей, вычисления среднего рейтинга, нахождения ближайшего дедлайна. 5) Relation свойства - Создание связей между записями разных database блоков, типы отношений: one-to-one (одна запись связана с одной записью), one-to-many (одна запись связана с многими), many-to-many (многие записи связаны с многими), двунаправленные связи (при создании связи A→B автоматически создается обратная связь B→A), настройка отображаемого свойства связанной записи (по умолчанию title), фильтрация доступных для связывания записей, лимиты на количество связей, каскадное удаление или сохранение связей при удалении записи. Примеры: связь Tasks → Projects (многие задачи принадлежат одному проекту), связь Students ↔ Courses (многие студенты посещают многие курсы), связь Orders → Customers (многие заказы от одного клиента). 6) Обратные отношения (backlinks) - Автоматическое отслеживание всех связей указывающих на запись, отображение секции Related/Backlinks в записи со списком всех записей ссылающихся на текущую, группировка backlinks по источнику (из какой БД), счетчик количества backlinks, быстрый переход к связанным записям, обновление backlinks в реальном времени при создании/удалении связей. 7) Linked databases - Создание нескольких представлений (views) одной database в разных местах документа, каждое linked database представление имеет независимые настройки: фильтры (показывать только записи удовлетворяющие условиям), сортировку (свой порядок сортировки), тип представления (Table, Board, Calendar и т.д.), отображаемые свойства (какие колонки показывать), группировку. Изменения данных в любом linked database представлении мгновенно отражаются во всех других представлениях (синхронизация в реальном времени), возможность создания записей из любого представления, все представления работают с одним источником данных (single source of truth). Примеры использования: главная БД Tasks со всеми задачами, linked database на странице проекта с фильтром по проекту, linked database в личном дашборде с фильтром по исполнителю, linked database в календаре с Calendar view. 8) Фильтрация и сортировка - Создание сложных фильтров с множественными условиями и логическими операторами (AND, OR), условия фильтрации для каждого типа свойства: Text (contains, does not contain, is, is not, starts with, ends with, is empty, is not empty), Number (=, ≠, >, <, ≥, ≤, is empty, is not empty), Select (is, is not, is any of, is none of, is empty, is not empty), Date (is, is before, is after, is on or before, is on or after, is within, is empty, is not empty, relative dates: today, tomorrow, yesterday, one week ago, one week from now), Checkbox (is checked, is not checked), Relation (contains, does not contain, is empty, is not empty). Сортировка по нескольким свойствам с приоритетом (primary sort, secondary sort), ascending/descending для каждого уровня сортировки, сохранение настроек фильтрации и сортировки в представлении. 9) Группировка - Группировка записей по любому свойству (Select, Multi-select, Person, Date, Checkbox), отображение групп как сворачиваемых секций, подсчет записей в каждой группе, вложенная группировка (группировка по нескольким свойствам одновременно), сортировка групп, скрытие пустых групп, агрегация значений в группах (сумма, среднее для числовых свойств). 10) Поиск - Full-text поиск по всем текстовым свойствам записей, поиск по title записи, поиск внутри многострочного текста, подсветка найденных совпадений, фильтрация результатов поиска, поиск с учетом или без учета регистра. 11) Экспорт и импорт - Экспорт database в CSV (для Excel/Google Sheets), JSON (структурированные данные с сохранением типов свойств), Markdown (таблица в Markdown формате), HTML (таблица в HTML), PDF (печатная версия). Импорт из CSV с автоматическим определением типов свойств, импорт из JSON с сохранением структуры, импорт из других систем (Notion, Airtable, Google Sheets), маппинг колонок при импорте, валидация данных при импорте, обработка ошибок импорта. 12) API для работы с database - Программное создание database блоков, добавление/удаление/обновление записей через API, создание и настройка свойств, создание представлений программно, фильтрация и сортировка через API, массовые операции (bulk operations), webhooks для отслеживания изменений в database, интеграция с внешними системами через API"
      }
    }
  }
}
