{
  "id": "169",
  "text": "Unit-архитектура: страницы/документы как независимые контейнеры с уникальным ID, заголовком, метаданными и упорядоченным списком блоков, поддерживающие вложенность страниц, навигацию и CRUD операции через API",
  "categories": [
    "architecture",
    "editor",
    "ai-criteria",
    "quality"
  ],
  "tags": [
    "Unit",
    "страницы",
    "документы",
    "контейнер",
    "иерархия",
    "навигация",
    "метаданные",
    "UNIT_ID"
  ],
  "categories_info": [
    {
      "key": "architecture",
      "title": "Общие архитектурные принципы для движка",
      "description": "Фундаментальные правила построения всей системы"
    },
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    },
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    }
  ],
  "contexts": {
    "architecture": {
      "subcategories": [],
      "descriptions": {
        "null": "Фундаментальный архитектурный принцип Unit-Block: система построена на двухуровневой иерархии где Unit (страница/документ) является контейнером верхнего уровня содержащим упорядоченный список Block (блоков контента из критерия 003). Каждый Unit существует как независимая сущность с собственным жизненным циклом и может содержать другие Unit для создания древовидной структуры документов. Unit-first подход: сначала создается Unit затем наполняется блоками. Слабая связанность: Unit не зависят друг от друга на уровне реализации, изменение одного Unit не влияет на другие. Полиморфизм: единый интерфейс для работы со всеми Unit независимо от их содержимого. Сериализация: Unit сериализуются в JSON формат включая все вложенные блоки для хранения и передачи. Масштабируемость: архитектура поддерживает 10000+ Unit и 100000+ блоков через ленивую загрузку и индексацию"
      }
    },
    "editor": {
      "subcategories": [
        "Навигация и связи",
        "Блоки контента"
      ],
      "descriptions": {
        "Навигация и связи": "Unit как основа навигационной структуры редактора: 1) Структура Unit - id: уникальный идентификатор (UUID v4 или custom UNIT_ID), title: заголовок страницы (обязательное поле, отображается в навигации), icon: эмодзи или иконка для визуальной идентификации, cover: обложка страницы (изображение или цвет), blocks: упорядоченный массив BLOCK_ID из критерия 003, parent_id: ID родительского Unit для вложенности, children: массив ID дочерних Unit, metadata: {created_at, updated_at, author, contributors, version, status}, properties: пользовательские свойства (теги, категории, приоритет, дедлайн), permissions: права доступа (owner, editors, viewers), settings: настройки отображения (ширина контента, шрифт, тема). 2) Независимость Unit - каждый Unit может быть открыт, отредактирован, сохранен, экспортирован независимо от других Unit, Unit сохраняет свое состояние включая позицию скролла и выделенные блоки, Unit может существовать без родителя (root-level pages) или быть вложенным на любую глубину, перемещение Unit в другое место иерархии не влияет на его содержимое, Unit может быть дублирован со всеми вложенными блоками и дочерними Unit, удаление Unit может сохранять дочерние Unit (перемещение на уровень выше) или удалять каскадно. 3) Иерархия и вложенность Unit - поддержка неограниченной глубины вложенности Unit (страница → подстраница → подподстраница), parent-child связи через parent_id и children массив, breadcrumbs навигация показывающая путь от root до текущего Unit, sidebar с древовидной структурой всех Unit с возможностью сворачивания/разворачивания веток, drag-and-drop перемещение Unit в дереве с автоматическим обновлением parent-child связей, автоматическая сортировка дочерних Unit (по дате создания, алфавиту, custom order), визуальная индикация уровня вложенности через отступы в sidebar. 4) Навигация между Unit - быстрый переход по UNIT_ID или title через поиск (Cmd+K), история навигации (назад/вперед как в браузере), закладки (favorites) для быстрого доступа к часто используемым Unit, недавно открытые Unit (recent pages), ссылки между Unit через @ mentions или [[wiki-links]], backlinks панель показывающая все Unit ссылающиеся на текущий, граф связей между Unit для визуализации структуры знаний, tabs для одновременной работы с несколькими Unit. 5) Интеграция с блоками (критерий 003) - Unit содержит упорядоченный список BLOCK_ID, блоки рендерятся в порядке указанном в blocks массиве, добавление блока в Unit через API: addBlockToUnit(unit_id, block_id, position), перемещение блока между Unit: moveBlockToUnit(block_id, from_unit_id, to_unit_id, position), блок может существовать только в одном Unit (не может быть shared между Unit), при удалении Unit все его блоки также удаляются (каскадное удаление), при экспорте Unit экспортируются все его блоки с сохранением структуры",
        "Блоки контента": "Unit как контейнер для блоков из критерия 003: каждый Unit содержит упорядоченный список блоков любых типов (paragraph, heading, table, code, image, etc), блоки в Unit могут быть любой комбинации и в любом порядке, Unit управляет порядком отображения блоков через blocks массив, операции с блоками внутри Unit: добавление нового блока, перемещение блока вверх/вниз, удаление блока из Unit, копирование блока в другой Unit"
      }
    },
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Требования к ИИ для работы с Unit-архитектурой: понимание концепции Unit как контейнера для блоков и основы организации контента, автоматическое создание Unit при генерации большого объема контента (разбиение на логические страницы), предложение оптимальной структуры Unit для организации информации (главная страница → разделы → подразделы), генерация заголовков и метаданных для Unit на основе содержимого блоков, автоматическая организация Unit в иерархию (определение parent-child связей), рефакторинг структуры Unit (объединение связанных Unit, разбиение большого Unit на несколько), предложение создания вложенных Unit для детализации информации, автоматическое создание навигационных ссылок между связанными Unit, генерация оглавления (table of contents) на основе структуры Unit и заголовков блоков, предложение тегов и категорий для Unit на основе анализа содержимого, создание шаблонов Unit для типовых сценариев (meeting notes, project plan, documentation page), валидация структуры Unit перед созданием (проверка обязательных полей, корректности связей)"
      }
    },
    "quality": {
      "subcategories": [
        "Архитектурная целостность"
      ],
      "descriptions": {
        "Архитектурная целостность": "Требования к качеству Unit-архитектуры: валидация структуры Unit при создании и обновлении (проверка обязательных полей id и title), проверка уникальности UNIT_ID в пределах системы, валидация иерархии (предотвращение циклических зависимостей parent-child где Unit является родителем самого себя через цепочку), проверка существования всех BLOCK_ID указанных в blocks массиве, валидация parent_id и children (соответствие двунаправленных связей), автоматическое исправление некорректных структур при импорте, логирование всех операций с Unit для аудита (создание, обновление, перемещение, удаление), метрики производительности операций с Unit (время загрузки, поиска, рендеринга), тестовое покрытие >80% для всех операций с Unit, документация структуры Unit с примерами JSON, JSON Schema для валидации структуры Unit, индексация Unit для быстрого поиска по title, tags, content, ленивая загрузка Unit и блоков для оптимизации производительности при большом количестве страниц, кэширование часто используемых Unit, мониторинг целостности связей между Unit и блоками"
      }
    }
  }
}
