{
  "id": "173",
  "text": "Индексация и полнотекстовый поиск в больших объемах данных: реализация full-text search для быстрого поиска по 10,000+ страниц и 100,000+ блоков через search indexes (Lunr.js, FlexSearch, MiniSearch, Fuse.js), инкрементальная индексация при создании/изменении контента, поддержка сложных запросов (AND, OR, NOT, фразовый поиск, wildcard), фильтрация и сортировка результатов по релевантности, кэширование результатов поиска, fuzzy search для опечаток, highlighting найденных фрагментов, search suggestions и autocomplete",
  "categories": [
    "architecture",
    "editor",
    "quality"
  ],
  "tags": [
    "индексация",
    "поиск",
    "full-text search",
    "search index",
    "Lunr.js",
    "FlexSearch",
    "фильтрация",
    "сортировка",
    "fuzzy search",
    "autocomplete"
  ],
  "categories_info": [
    {
      "key": "architecture",
      "title": "Общие архитектурные принципы для движка",
      "description": "Фундаментальные правила построения всей системы"
    },
    {
      "key": "editor",
      "title": "Движок редактора",
      "description": "Требования к ядру редактора"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    }
  ],
  "contexts": {
    "architecture": {
      "subcategories": [],
      "descriptions": {
        "null": "Архитектура системы индексации и поиска для больших объемов данных. Выбор search engine: Lunr.js - полнофункциональный search с поддержкой stemming и языков (размер ~8KB, скорость средняя), FlexSearch - самый быстрый search engine с минимальным размером (~3KB, отличная производительность), MiniSearch - легковесный с хорошим балансом функций и размера (~6KB), Fuse.js - fuzzy search специализированный на нечетком поиске (~12KB), выбор зависит от требований (скорость vs функциональность vs размер). Инкрементальная индексация: добавление документов в индекс при создании без полной переиндексации, обновление индекса при изменении контента (debounced для производительности), удаление из индекса при удалении документов, batch индексация для массовых операций, фоновая индексация через Web Workers для не блокирования UI, персистентность индекса в IndexedDB для быстрой загрузки. Структура индекса: индексация заголовков с повышенным весом (boost factor), индексация тела документа с нормальным весом, индексация тегов и метаданных, индексация связей между документами, поддержка множественных полей (title, content, tags, metadata), настройка tokenization и stemming для разных языков. Оптимизация индекса: компрессия индекса для уменьшения размера в памяти/storage, sharding индекса для очень больших объемов (>100K документов), lazy loading частей индекса по требованию, периодическая оптимизация индекса (defragmentation), балансировка между размером индекса и скоростью поиска"
      }
    },
    "editor": {
      "subcategories": [],
      "descriptions": {
        "null": "Функциональность поиска в редакторе для пользователей. Full-text search интерфейс: глобальный поиск по всем страницам и блокам (Cmd/Ctrl+K), поиск внутри текущей страницы (Cmd/Ctrl+F), мгновенные результаты при вводе (instant search), отображение количества результатов и их контекста, навигация по результатам (Next/Previous), переход к найденному блоку с подсветкой. Сложные запросы: поддержка булевых операторов (AND, OR, NOT) для комбинирования условий, фразовый поиск в кавычках для точного совпадения, wildcard поиск (* и ?) для частичного совпадения, поиск по полям (title:keyword, tag:label, author:name), исключение слов через минус (-keyword), группировка условий через скобки. Фильтрация результатов: фильтр по типу контента (страницы, блоки, таблицы, изображения), фильтр по датам (создания, изменения, последнего доступа), фильтр по тегам и категориям, фильтр по автору и участникам, фильтр по статусу (черновик, опубликовано, архив), комбинирование фильтров для точного поиска. Сортировка результатов: по релевантности (BM25, TF-IDF scoring), по дате (новые/старые первыми), по названию (алфавитный порядок), по популярности (количество просмотров, ссылок), пользовательская сортировка, сохранение предпочтений сортировки. Fuzzy search и опечатки: автоматическое исправление опечаток (edit distance), поиск похожих слов при отсутствии точных совпадений, настройка чувствительности fuzzy search (threshold), suggestions для исправления запроса, поиск синонимов для расширения результатов. Search suggestions и autocomplete: автодополнение запроса при вводе на основе истории поиска, популярные запросы и trending searches, suggestions на основе содержимого документов, персонализированные suggestions на основе активности пользователя, быстрые фильтры и shortcuts в suggestions. Highlighting и preview: подсветка найденных фрагментов в результатах (keyword highlighting), контекстный preview с окружающим текстом (snippet), подсветка в самом документе при переходе, навигация между найденными вхождениями в документе, сохранение позиции поиска при возврате к результатам"
      }
    },
    "quality": {
      "subcategories": [
        "Производительность"
      ],
      "descriptions": {
        "Производительность": "Требования к производительности системы поиска для больших объемов. Скорость поиска: поиск по 10K документов должен занимать < 100ms, поиск по 100K документов должен занимать < 500ms, instant search с результатами при каждом нажатии клавиши (debounced 150-300ms), индексация нового документа < 50ms, batch индексация 1000 документов < 5s. Размер индекса: индекс должен занимать не более 10-20% от размера исходных данных, компрессия индекса для уменьшения memory footprint, lazy loading индекса по частям для больших объемов, хранение индекса в IndexedDB для персистентности, синхронизация индекса между вкладками через BroadcastChannel. Кэширование результатов: кэширование результатов популярных запросов в памяти (LRU cache), TTL для cache entries (обычно 5-15 минут), инвалидация cache при изменении индексированных документов, предиктивное кэширование для anticipated queries, мониторинг hit rate кэша для оптимизации. Оптимизация запросов: ранняя остановка поиска при достижении достаточного количества результатов (top-K), skip lists для быстрого пропуска нерелевантных документов, query optimization для сложных булевых запросов, параллельная обработка независимых частей запроса, использование Web Workers для поиска в фоне. Масштабирование: горизонтальное масштабирование через sharding индекса, распределенный поиск по нескольким shards, aggregation результатов из разных shards, load balancing между search workers, graceful degradation при высокой нагрузке (упрощение запросов, уменьшение результатов). Мониторинг и метрики: отслеживание времени выполнения запросов (p50, p95, p99), мониторинг размера индекса и memory usage, tracking популярных запросов для оптимизации, алерты на медленные запросы (> 1s), A/B тестирование алгоритмов ранжирования"
      }
    }
  }
}
