{
  "id": "174",
  "text": "Генерация rules для Amazon Q Developer: автоматическое создание customization rules из критериев проекта для интеграции с Amazon Q, конвертация критериев в формат .amazonq/rules/ (Markdown файлы), структурирование правил по категориям (architecture, quality, processes, prompts), приоритизация правил (HIGHEST PRIORITY для критических), синхронизация rules с изменениями критериев, валидация формата rules, документирование использования rules в IDE",
  "categories": [
    "ai-criteria",
    "tools",
    "processes"
  ],
  "tags": [
    "Amazon Q",
    "rules",
    "customization",
    "генерация",
    "автоматизация",
    "IDE integration",
    "конвертация"
  ],
  "categories_info": [
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "tools",
      "title": "Инструменты",
      "description": "Практические инструменты для упрощения парной разработки с ИИ-ассистентом"
    },
    {
      "key": "processes",
      "title": "Процессы разработки",
      "description": "Методологии и практики работы команды"
    }
  ],
  "contexts": {
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "Интеграция критериев проекта с Amazon Q Developer для контекстно-осведомленной генерации кода. Формат Amazon Q rules: Markdown файлы в директории [workspace_root]/.amazonq/rules/ автоматически загружаются Amazon Q при работе в IDE, каждый rule файл содержит инструкции для ИИ по конкретному аспекту разработки, поддержка приоритизации через HIGHEST PRIORITY для критических правил, правила применяются ко всем запросам в chat и inline completions, возможность override conflicting instructions через explicit priority. Конвертация критериев в rules: автоматическая генерация rule файлов из существующих критериев проекта (001-173), группировка rules по категориям (architecture-rules.md, quality-rules.md, processes-rules.md, prompts-rules.md), извлечение ключевых требований из contexts каждого критерия, форматирование в понятные инструкции для Amazon Q, добавление примеров использования и anti-patterns, приоритизация критических правил (ядро, фундамент, несущие стены). Структура rule файла: заголовок с названием правила и приоритетом, краткое описание назначения правила, детальные инструкции что делать и чего избегать, примеры правильного и неправильного кода, ссылки на связанные критерии и документацию, условия применения правила (когда применять, когда игнорировать). Синхронизация с критериями: автоматическое обновление rules при изменении критериев, версионирование rules для отслеживания изменений, валидация соответствия rules актуальным критериям, уведомления о необходимости обновления rules, интеграция с CI/CD для автоматической генерации"
      }
    },
    "tools": {
      "subcategories": [],
      "descriptions": {
        "null": "Инструменты для генерации и управления Amazon Q rules. Генератор rules: скрипт для автоматической конвертации критериев в Amazon Q rules формат, чтение критериев из ref3/criteria/*.json, группировка по категориям и приоритетам, генерация Markdown файлов в .amazonq/rules/, добавление метаданных (дата генерации, версия критериев, автор), валидация формата и структуры rules. Шаблоны rules: базовые шаблоны для разных типов правил (architecture, quality, processes, prompts), переменные для подстановки данных из критериев, условная логика для разных контекстов применения, примеры кода и anti-patterns, секции для troubleshooting и FAQ. Валидация rules: проверка синтаксиса Markdown, валидация структуры rule файлов (обязательные секции), проверка ссылок на критерии и документацию, lint правил для консистентности стиля, тестирование rules через Amazon Q API. Управление версиями: Git для версионирования rules файлов, changelog для отслеживания изменений rules, tagging версий rules синхронно с версиями критериев, rollback к предыдущим версиям при проблемах, branch strategy для экспериментов с новыми rules. Мониторинг использования: отслеживание какие rules применяются чаще всего, сбор feedback от разработчиков о полезности rules, A/B тестирование разных формулировок rules, метрики эффективности (качество генерируемого кода, соответствие критериям), итеративное улучшение rules на основе данных"
      }
    },
    "processes": {
      "subcategories": [
        "Работа с задачами"
      ],
      "descriptions": {
        "Работа с задачами": "Процесс работы с Amazon Q rules в команде разработки. Создание новых rules: при добавлении нового критерия автоматически генерируется соответствующий rule, review нового rule командой перед добавлением в проект, тестирование rule на реальных задачах для валидации эффективности, документирование примеров использования rule, интеграция rule в общий набор правил проекта. Обновление существующих rules: регулярный review rules на актуальность (ежемесячно или при major changes), обновление rules при изменении критериев или best practices, рефакторинг rules для улучшения clarity и effectiveness, добавление новых примеров и edge cases, синхронизация с изменениями в кодовой базе. Обучение команды: onboarding новых разработчиков с объяснением rules, документация по использованию Amazon Q с project rules, примеры успешного применения rules в проекте, troubleshooting guide для проблем с rules, регулярные knowledge sharing sessions о новых rules. Feedback loop: сбор feedback от команды о полезности и проблемах с rules, приоритизация улучшений rules на основе feedback, быстрое реагирование на проблемные rules (fix или disable), измерение impact rules на качество кода и productivity, итеративное улучшение rules на основе опыта команды. Интеграция с workflow: rules автоматически применяются при работе с Amazon Q в IDE, проверка соответствия кода rules при code review, автоматические suggestions от Amazon Q на основе rules, интеграция rules с CI/CD для валидации кода, документирование отклонений от rules с обоснованием"
      }
    }
  }
}
