{
  "id": "183",
  "text": "Единая система для создания, управления и визуализации стратегического плана развития проекта с интеграцией всех типов диаграмм Mermaid. Полная картина архитектурных решений, временных рамок, зависимостей между модулями и приоритизации задач",
  "categories": [
    "ai-criteria",
    "processes",
    "quality",
    "tools"
  ],
  "tags": [
    "Gantt",
    "KPI",
    "Mermaid",
    "mindmap",
    "roadmap"
  ],
  "categories_info": [
    {
      "key": "ai-criteria",
      "title": "Критерии для нейросети",
      "description": "Требования к интеграции ИИ-помощника"
    },
    {
      "key": "processes",
      "title": "Процессы разработки",
      "description": "Методологии и практики работы команды"
    },
    {
      "key": "quality",
      "title": "Требования к качеству",
      "description": "Нефункциональные требования и стандарты"
    },
    {
      "key": "tools",
      "title": "Инструменты",
      "description": "Практические инструменты для упрощения парной разработки с ИИ-ассистентом"
    }
  ],
  "contexts": {
    "ai-criteria": {
      "subcategories": [],
      "descriptions": {
        "null": "AI-ассистированное планирование: генерация roadmap на основе критериев проекта, прогнозирование сроков с помощью ML, автоматическая корректировка приоритетов, интеграция с промпт-системой"
      }
    },
    "processes": {
      "subcategories": ["Работа с задачами"],
      "descriptions": {
        "Работа с задачами": "Граф зависимостей и последовательности разработки, временной roadmap с этапами и вехами, матрица приоритетов и рисков, диаграмма переходов состояний разработки, система мониторинга и обновления"
      }
    },
    "quality": {
      "subcategories": ["Документация"],
      "descriptions": {
        "Документация": "Архитектурная карта проекта, схема альтернативных решений, интеграция с существующими критериями, документация и обучение, руководства и шаблоны"
      }
    },
    "tools": {
      "subcategories": [],
      "descriptions": {
        "null": "Инструменты визуализации: Mindmap, Flowchart, Sequence diagram, Class diagram, State diagram, Gantt chart, Pie chart, XY chart, Graph, Requirement diagram. Экспорт в форматы: Mermaid, JSON, Markdown, PDF, PNG"
      }
    }
  }
}
